"""
Создайте матрицу размером 3х3 и выведите значения с индексами 1,2 и 3,3
"""
matrix = [[1,2,3],
        [4,1,2],
        [2,1,1]]
print(matrix[0][1], matrix[2][2])
