"""
Напишите программу принимающую ввод информации о треке(место в чарте,исполнитель, название) пока пользователь
не введет "off". Программа должна вывести всю информацию в виде словаря вида: {(место,испонитель): название трека}
"""
for i in range(12):
    music_dict = {}
    place = input('место в чарте:оff чтобы завешить')
    name = input('никнейм исполнителя:оff чтобы завешить')
    song = input('название:оff чтобы завешить')
    print()
    break
