"""
Создайте словарь, в котором ключами будут числа от 1 до 10, а значениями эти же числа, возведенные в куб.
"""
numbers_dict = {}
for i in range(11):
    numbers_dict[i] = i**3
print(numbers_dict)

